# 第五章 pandas入门

In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [2]:
import numpy as np

## 5.1 pandas数据结构介绍

### Series

In [3]:
obj = pd.Series([4, -5 ,4, 6])
obj

0    4
1   -5
2    4
3    6
dtype: int64

In [4]:
obj.values

array([ 4, -5,  4,  6], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4, 7, -5, 3], index=['d','b','a', 'e'])
obj2

d    4
b    7
a   -5
e    3
dtype: int64

In [7]:
obj2.index

Index(['d', 'b', 'a', 'e'], dtype='object')

In [8]:
obj2['a']

-5

In [9]:
obj2['d'] = 6
obj2

d    6
b    7
a   -5
e    3
dtype: int64

In [10]:
obj2[['a', 'b', 'd']] # 可以选取一组值

a   -5
b    7
d    6
dtype: int64

In [11]:
# numpy函数或类似numpy的运算
obj2[obj2 > 0]

d    6
b    7
e    3
dtype: int64

In [12]:
obj2 * 2

d    12
b    14
a   -10
e     6
dtype: int64

In [13]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
e      20.085537
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
'f' in obj2

False

In [16]:
# 通过字典创建
sdata = {'Ohio': 35000, 'Taxes': 71000, 'Oregon': 90000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Taxes     71000
Oregon    90000
dtype: int64

In [17]:
# 传入字典的键改变顺序
states = ['Taxes', 'Oregon', 'Ohio', 'California']
obj4 = pd.Series(sdata, states)
obj4

Taxes         71000.0
Oregon        90000.0
Ohio          35000.0
California        NaN
dtype: float64

In [18]:
obj4.isnull()

Taxes         False
Oregon        False
Ohio          False
California     True
dtype: bool

In [19]:
obj4.notnull()

Taxes          True
Oregon         True
Ohio           True
California    False
dtype: bool

In [20]:
pd.isnull(obj4)

Taxes         False
Oregon        False
Ohio          False
California     True
dtype: bool

In [21]:
pd.notnull(obj4)

Taxes          True
Oregon         True
Ohio           True
California    False
dtype: bool

In [22]:
obj3 + obj4 # 自动对齐数据

California         NaN
Ohio           70000.0
Oregon        180000.0
Taxes         142000.0
dtype: float64

In [23]:
# Series本身和索引的name属性
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
Taxes         71000.0
Oregon        90000.0
Ohio          35000.0
California        NaN
Name: population, dtype: float64

In [24]:
# 赋值改变索引
obj

0    4
1   -5
2    4
3    6
dtype: int64

In [25]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve   -5
Jeff     4
Ryan     6
dtype: int64

### DataFrame

In [26]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [27]:
frame.head() # 前五行

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [28]:
frame.tail() # 后五行

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [29]:
pd.DataFrame(data, columns=['year','state','pop']) # 指定列顺序

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [30]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
....: index=['one', 'two', 'three', 'four',
....: 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [31]:
frame2['state'] # 获取一个Series

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [32]:
frame2.state # 获取一个Series

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [33]:
frame2.loc['three'] # 获取行Series

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [34]:
frame2['debt'] = 16.5 # 赋一组值
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [35]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [36]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [37]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [38]:
del frame2['eastern'] # 删除列
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [39]:
# 嵌套字典, 外层键为列索引，内层键为行索引
pop = {
    'Nevada': {
        2001: 2.4,
        2002: 2.9
    },
    'Ohio': {
        2000: 1.5,
        2001: 1.7,
        2002: 3.6
    }
}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [40]:
frame3.T # 转置

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [41]:
# 由Series组成的字典也差不多
pdata = {
    'Ohio': frame3['Ohio'][:-1],
    'Nevada': frame3['Nevada'][:2]
}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [42]:
# 指定行列name
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [43]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [44]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### 索引对象

In [48]:
obj = pd.Series(range(3), index = ['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [51]:
index[1:]

Index(['b', 'c'], dtype='object')

In [53]:
index[1] # index对象不可变

'b'

In [59]:
labels = pd.Index(np.arange(3)) # 传递index对象
obj2 = pd.Series([1.5, -2, 12.3], index = labels)
obj2.index is labels

True

In [60]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [61]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [62]:
'Ohio' in frame3.columns

True

In [63]:
2003 in frame3.index

False

## 5.2 基本功能

### 重新索引

In [64]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int64

In [79]:
obj.reindex(['a', 'b', 'c', 'd']) # 重新索引

a    0.0
b    1.0
c    2.0
d    NaN
dtype: float64

In [74]:
obj2 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj2

0      blue
2    purple
4    yellow
dtype: object

In [76]:
obj2.reindex(range(6), method='ffill') # 前向值填充

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [88]:
frame = pd.DataFrame(np.arange(9).reshape((3,3)), index = ['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [90]:
frame2 = frame.reindex(['a','b','c','d']) # 重新索引列索引
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [89]:
states = ['Texas', 'Utah' ,'California'] # 重新索引
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### 丢弃指定轴上的项

In [94]:
# drop
obj

a    0
b    1
c    2
dtype: int64

In [95]:
obj.drop('c')

a    0
b    1
dtype: int64

In [96]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [98]:
frame.drop(['a', 'd'])

   Ohio  Texas  California
c     3      4           5

In [101]:
frame.drop(['Ohio'], axis=1) # 或axis='columns'

   Texas  California
a      1           2
c      4           5
d      7           8

In [102]:
obj

a    0
b    1
c    2
dtype: int64

In [103]:
obj.drop('c', inplace=True) # 在原数据上删除

In [104]:
obj

a    0
b    1
dtype: int64

### 索引、选取和过滤